layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 28 dim: 28 } }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "data"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}