layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 28 dim: 28 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 1
    kernel_size: 11
    stride: 4
    weight_filler{
        type:"constant"
        value:1
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "data"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "data"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "data"
  top: "relu1"
}
layer {
  name: "sigmoid1"
  type: "Sigmoid"
  bottom: "data"
  top: "sigmoid1"
}
layer {
  name: "tanh1"
  type: "TanH"
  bottom: "data"
  top: "tanh1"
}
layer {
  name: "dense1"
  type: "InnerProduct"
  bottom: "data"
  top: "dense1"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "constant"
      value:1
    }
  }
}
